Repository: hsul4n/flutter-packages
Catalog: packages/units_localizations/lib/units_*.arb
Languages: ar

# knots
source: {value,plural, =0{knots}=1{knot}other{knots}}
ar: {value,plural, =0{عُقدة}=1{عُقدة}other{عُقدة}}

source: {kilometers} per {hours}
ar: {kilometers} في {hours}

source: {miles} per {hours}
ar: {miles} في {hours}

source: {meters} per {seconds}
ar: {meters} في {seconds}

source: {kilometers} per {liters}
ar: {kilometers} لكل {liters}

source: {meters} per {liters}
ar: {meters} لكل {liters}

source: {miles} per imperial {gallons}
ar: {miles} لكل امبراطوري {gallons}

source: {miles} per US {gallons}
ar: {miles} لكل امريكي {gallons}

# miles
source: {length,plural, =0{miles}=1{mile}other{miles}}
ar: {length,plural, =0{ميل}=1{ميل}other{ميل}}

# inches
source: {length,plural, =0{inches}=1{inche}other{inches}}
ar: {length,plural, =0{بوصة}=1{بوصة}other{بوصة}}

# meters
source: {length,plural, =0{meters}=1{meter}other{meters}}
ar: {length,plural, =0{متر}=1{متر}other{متر}}

# kilometers
source: {length,plural, =0{kilometers}=1{kilometer}other{kilometers}}
ar: {length,plural, =0{كيلومتر}=1{كيلومتر}other{كيلومتر}}

source: {grams} per {meters}
ar: {grams} لكل {meters}

source: {grams} per {miles}
ar: {grams} لكل {miles}

source: {kilograms} per {kilometers}
ar: {kilograms} لكل {kilometers}

source: {kilograms} per {meters}
ar: {kilograms} لكل {meters}

source: {grams} per {kilometers}
ar: {grams} لكل {kilometers}

# micrograms
source: {value,plural, =0{micrograms}=1{microgram}other{micrograms}}
ar: {value,plural, =0{ميكروغرام}=1{ميكروغرام}other{ميكروغرام}}

# milligrams
source: {value,plural, =0{milligrams}=1{milligram}other{milligrams}}
ar: {value,plural, =0{مليغرام}=1{مليغرام}other{مليغرام}}

# grams
source: {value,plural, =0{grams}=1{gram}other{grams}}
ar: {value,plural, =0{جرام}=1{جرام}other{جرام}}

# tons
source: {value,plural, =0{tons}=1{ton}other{tons}}
ar: {value,plural, =0{طن}=1{طن}other{طن}}

# ounce
source: {value,plural, =0{ounces}=1{ounce}other{ounces}}
ar: {value,plural, =0{اونصه}=1{اونصه}other{اونصه}}

# stone
source: {value,plural, =0{stones}=1{stone}other{stones}}
ar: {value,plural, =0{حجر}=1{حجر}other{حجر}}

# pounds
source: {value,plural, =0{pounds}=1{pound}other{pounds}}
ar: {value,plural, =0{رطل}=1{رطل}other{رطل}}

# kilograms
source: {value,plural, =0{kilograms}=1{kilogram}other{kilograms}}
ar: {value,plural, =0{كيلوجرام}=1{كيلوجرام}other{كيلوجرام}}

# pascals
source: {value,plural, =0{pascal}=1{pascal}other{pascals}}
ar: {value,plural, =0{باسكال}=1{باسكال}other{باسكال}}

# bars
source: {value,plural, =0{bar}=1{bar}other{bars}}
ar: {value,plural, =0{بار}=1{بار}other{بار}}

# poundForcePerSquareInch
source: {pounds} force per square {inches}
ar: {pounds} رطل لكل بوصة مربعة {inches}

# celsius
source: {value,plural, =0{celsius}=1{celsius}other{celsius}}
ar: {value,plural, =0{درجة مئوية}=1{درجة مئوية}other{درجة مئوية}}

# fahrenheit
source: {value,plural, =0{fahrenheit}=1{fahrenheit}other{fahrenheit}}
ar: {value,plural, =0{فهرنهايت}=1{فهرنهايت}other{فهرنهايت}}

# kelvin
source: {value,plural, =0{kelvin}=1{kelvin}other{kelvins}}
ar: {value,plural, =0{كلفن}=1{كلفن}other{كلفن}}

# rankine
source: {value,plural, =0{rankine}=1{rankine}other{rankines}}
ar: {value,plural, =0{رانكين}=1{رانكين}other{رانكين}}

# romer
source: {value,plural, =0{rømer}=1{rømer}other{rømer}}
ar: {value,plural, =0{رومر}=1{رومر}other{رومر}}

# century
source: {time,plural, =0{centuries}=1{century}other{centuries}}
ar: {time,plural, =0{قرون}=1{قرن}other{قرون}}

# decade
source: {time,plural, =0{decades}=1{decade}other{decades}}
ar: {time,plural, =0{عقود}=1{عقد}other{عقود}}

# year
source: {time,plural, =0{year}=1{year}other{years}}
ar: {time,plural, =0{سنة}=1{سنة}other{سنة}}

# month
source: {time,plural, =0{month}=1{month}other{months}}
ar: {time,plural, =0{شهر}=1{شهر}other{شهر}}

# monthAbbreviation
source: {time,plural, =0{mo}=1{mo}other{mos}}
ar: {time,plural, =0{شهر}=1{شهر}other{شهر}}

# week
source: {time,plural, =0{week}=1{week}other{weeks}}
ar: {time,plural, =0{اسبوع}=1{اسبوع}other{اسبوع}}

# day
source: {time,plural, =0{days}=1{day}other{days}}
ar: {time,plural, =0{يوم}=1{ايام}other{يوم}}

# hour
source: {time,plural, =0{hours}=1{hour}other{hours}}
ar: {time,plural, =0{ساعة}=1{ساعة}other{ساعة}}

# minute
source: {time,plural, =0{minute}=1{minute}other{minutes}}
ar: {time,plural, =0{دقيقة}=1{دقيقة}other{دقيقة}}

# second
source: {time,plural, =0{seconds}=1{second}other{seconds}}
ar: {time,plural, =0{ثانية}=1{ثانية}other{ثانية}}

# millisecond
source: {time,plural, =0{millisecond}=1{millisecond}other{milliseconds}}
ar: {time,plural, =0{ميلي ثانية}=1{ميلي ثانية}other{ميلي ثانية}}

# microsecond
source: {time,plural, =0{microsecond}=1{microsecond}other{microseconds}}
ar: {time,plural, =0{ميكروثانية}=1{ميكروثانية}other{ميكروثانية}}

# imperialGallonsPerMiles
source: imp {gallons} per {miles}
ar: {gallons} امبراطوري لكل {miles}

source: US {gallons} per {miles}
ar: {gallons} امريكي لكل {miles}

source: {liters} per {meters}
ar: {liters} لكل {meters}

source: {liters} per {kilometers}
ar: {liters} لكل {kilometers}

# cubicFoot
source: {volume,plural, =0{cubic foot}=1{cubic foot}other{cubic foot}}
ar: {volume,plural, =0{قدم مكعب}=1{قدم مكعب}other{قدم مكعب}}

# cubicInch
source: {volume,plural, =0{cubic inch}=1{cubic inch}other{cubic inch}}
ar: {volume,plural, =0{بوصة مكعب}=1{بوصة مكعب}other{بوصة مكعب}}

# cubicMeter
source: {volume,plural, =0{cubic meter}=1{cubic meter}other{cubic meter}}
ar: {volume,plural, =0{متر مكعب}=1{متر مكعب}other{متر مكعب}}

# cup
source: {volume,plural, =0{cups}=1{cup}other{cups}}
ar: {volume,plural, =0{اكواب}=1{كوب}other{اكواب}}

# fluidOunces
source: {volume,plural, =0{fluid ounces}=1{fluid ounce}other{fluid ounces}}
ar: {volume,plural, =0{أوقية سوائل}=1{سائل أوقية}other{أوقية سوائل}}

# quart
source: {volume,plural, =0{quarts}=1{quart}other{quarts}}
ar: {volume,plural, =0{كوارت}=1{كوارت}other{كوارت}}

# pint
source: {volume,plural, =0{pint}=1{pint}other{pints}}
ar: {volume,plural, =0{نصف لتر}=1{نصف لتر}other{نصف لتر}}

# tablespoon
source: {volume,plural, =0{tablespoon}=1{tablespoon}other{tablespoons}}
ar: {volume,plural, =0{ملعقة كبيرة}=1{ملعقة كبيرة}other{ملعقة كبيرة}}

# teaspoon
source: {volume,plural, =0{teaspoon}=1{teaspoon}other{teaspoons}}
ar: {volume,plural, =0{ملعقة صغيرة}=1{ملعقة صغيرة}other{ملعقة صغيرة}}

# gallons
source: {volume,plural, =0{gallons}=1{gallon}other{gallons}}
ar: {volume,plural, =0{جالون}=1{جالون}other{جالون}}

# milliliters
source: {volume,plural, =0{milliliters}=1{milliliter}other{milliliters}}
ar: {volume,plural, =0{مليلتر}=1{مليلتر}other{مليلتر}}

# liters
source: {volume,plural, =0{liters}=1{liter}other{liters}}
ar: {volume,plural, =0{لتر}=1{لتر}other{لتر}}
